data = {
	// 御三家
	1507: {
		name: "紅蓮的流星 伊格尼斯·波倫卡農",
		id: [1,2,3,4,1507],
		maxPot: [1,2,4,6,6],
		evol: [[],[],[],[]]
	},
	1508: {
		name: "暗黑神龍 伊芬納格",
		id: [9,10,11,12,1508],
		maxPot: [2,3,5,6,6],
		evol: [[],[],[],[]]
	},
	1509: {
		name: "祝福的聖女 莎夏·史塔萊特",
		id: [5,6,7,8,1509],
		maxPot: [2,4,5,6,6],
		evol: [[],[],[],[]]
	},
	// 惡作劇女神與兔子的故事
	1756: {
		name: "狂亂魔毒婦 維若妮卡‧吉瑪",
		id: [1753,1754,1755,1756],
		maxPot: [1,1,2,3],
		evol: [[1],[1],[1]]
	},
	1760: {
		name: "堅剛天盾 芭芭拉‧佛斯",
		id: [1757,1758,1759,1760],
		maxPot: [1,2,3,5],
		evol: [[1],[1],[1]]
	},
	1764: {
		name: "一箭聖心 英格麗特‧雷",
		id: [1761,1762,1763,1764],
		maxPot: [2,3,4,6],
		evol: [[1],[1],[1]]
	},
	1768: {
		name: "破軍神劍 萊納‧巴爾豪斯",
		id: [1765,1766,1767,1768],
		maxPot: [1,2,3,5],
		evol: [[1],[1],[1]]
	},
	// 歌頌永恆的克羅諾斯
	735: {
		name: "兔子天才發明家 魯道夫‧麥亞",
		id: [732,733,734,735],
		maxPot: [1,2,3,5],
		evol: [[1],[1],[1]]
	},
	765: {
		name: "槍手魔女 薇奧莉塔夫人",
		id: [762,763,764,765],
		maxPot: [1,2,4,6],
		evol: [[1],[1],[1]]
	},
	1300: {
		name: "時空超越者 妙舞‧伏爾杜娜",
		id: [1297,1298,1299,1300],
		maxPot: [1,2,4,5],
		evol: [[1],[1],[0,1]],
		material: [-28]
	},
	1301: {
		name: "征服多相者 妙舞‧雷文",
		id: [1297,1298,1299,1301],
		maxPot: [1,2,4,5],
		evol: [[1],[1],[0,1]],
		material: [-29]
	}
};

