data = {
	// 御三家
	1507: {
		name: "紅蓮的流星 伊格尼斯·波倫卡農",
		attr: "火",
		id: [1,2,3,4,1507],
		maxPot: [1,2,4,6,6],
		evol: [[],[],[],[]]
	},
	1508: {
		name: "暗黑神龍 伊芬納格",
		attr: "雷",
		id: [9,10,11,12,1508],
		maxPot: [2,3,5,6,6],
		evol: [[],[],[],[]]
	},
	1509: {
		name: "祝福的聖女 莎夏·史塔萊特",
		attr: "水",
		id: [5,6,7,8,1509],
		maxPot: [2,4,5,6,6],
		evol: [[],[],[],[]]
	},
	// 惡作劇女神與兔子的故事
	1756: {
		name: "狂亂魔毒婦 維若妮卡･吉瑪",
		attr: "水",
		id: [1753,1754,1755,1756],
		maxPot: [1,1,2,3],
		evol: [[1],[1],[1]]
	},
	1760: {
		name: "堅剛天盾 芭芭拉･佛斯",
		attr: "火",
		id: [1757,1758,1759,1760],
		maxPot: [1,2,3,5],
		evol: [[1],[1],[1]]
	},
	1764: {
		name: "一箭聖心 英格麗特･雷",
		attr: "水",
		id: [1761,1762,1763,1764],
		maxPot: [2,3,4,6],
		evol: [[1],[1],[1]]
	},
	1768: {
		name: "破軍神劍 萊納･巴爾豪斯",
		attr: "雷",
		id: [1765,1766,1767,1768],
		maxPot: [1,2,3,5],
		evol: [[1],[1],[1]]
	},
	// 歌頌永恆的克羅諾斯
	735: {
		name: "兔子天才發明家 魯道夫･麥亞",
		attr: "水",
		id: [732,733,734,735],
		maxPot: [1,2,3,5],
		evol: [[1],[1],[1]]
	},
	765: {
		name: "槍手魔女 薇奧莉塔夫人",
		attr: "雷",
		id: [762,763,764,765],
		maxPot: [1,2,4,6],
		evol: [[1],[1],[1]]
	},
	1300: {
		name: "時空超越者 妙舞･伏爾杜娜",
		attr: "火",
		id: [1297,1298,1299,1300],
		maxPot: [1,2,4,5],
		evol: [[1],[1],[0,1]],
		material: [-28]
	},
	1301: {
		name: "征服多相者 妙舞･雷文",
		attr: "火",
		id: [1297,1298,1299,1301],
		maxPot: [1,2,4,5],
		evol: [[1],[1],[0,1]],
		material: [-29]
	},
	// 黃昏的四聖書
	1595: {
		name: "功夫高手 玲馨･帝",
		attr: "火",
		id: [1593,1594,1595],
		maxPot: [1,2,4],
		evol: [[1],[1]]
	},
	1599: {
		name: "麒麟神將 秀蘭･帝王",
		attr: "水",
		id: [1596,1597,1598,1599],
		maxPot: [1,2,3,4],
		evol: [[1],[1],[1]]
	},
	1591: {
		name: "黃天女皇 依玲･帝王",
		attr: "雷",
		id: [1588,1589,1590,1591],
		maxPot: [1,2,3,5],
		evol: [[1],[1],[0,1]],
		material: [-34]
	},
	1592: {
		name: "邪龍女皇 依玲･帝王",
		attr: "雷",
		id: [1588,1589,1590,1592],
		maxPot: [1,2,3,5],
		evol: [[1],[1],[0,1]],
		material: [-35]
	},
	1586: {
		name: "黃天霸帝 狂･帝王",
		attr: "火",
		id: [1583,1584,1585,1586],
		maxPot: [1,3,4,6],
		evol: [[1],[1],[0,1]],
		material: [-36]
	},
	1587: {
		name: "邪龍帝 狂･帝王",
		attr: "火",
		id: [1583,1584,1585,1587],
		maxPot: [1,3,4,6],
		evol: [[1],[1],[0,1]],
		material: [-37]
	},
};

menu = [
	/*御三家*/
	1507,1508,1509,
	/*惡作劇女神與兔子的故事*/
	1756,1760,1764,1768,
	/*歌頌永恆的克羅諾斯*/
	735,765,1300,1301,
	/*黃昏的四聖書*/
	1595,1599,1591,1592,1586,1587
];
